Sakuemy/ESP8266_ValvePID/WebServerManager.cpp
#include "WebServerManager.h"
#include <ESP8266WebServer.h>
#include <ArduinoJson.h>
#include <base64.h> // base64::decode - входит в состав ESP8266 core, доп. библиотека не нужна
#include "TempSensor.h"
#include "ValveServo.h"
#include "TempHistory.h"
#include "TimeManager.h"
#include "NetworkManager.h"
#include "Storage.h"
#include "BatteryMonitor.h"

namespace WebServerManager {

static ESP8266WebServer server(80);
static Callbacks callbacks_;

// ----------------------------------------------------------------------
// Доступ по паролю (HTTP Basic Auth) к странице настроек и её API.
// Дашборд (/, /api/status, /api/history) остаётся открытым для мониторинга.
// Логин фиксирован (ADMIN_USERNAME), пароль проверяется через
// Storage::verifyPassword() (хранится только SHA-256 хэш, см. Storage.h) -
// поэтому встроенный server.authenticate() тут не подходит (он сравнивает
// с открытым паролем), разбираем заголовок Authorization вручную, по той
// же схеме, что использует сам ESP8266HTTPUpdateServer из ядра. Возвращает
// false и уже отправляет клиенту 401, если не прошли проверку - вызывающий
// обработчик должен в этом случае просто выйти.
static bool requireAuth() {
    AppSettings *s = callbacks_.getSettings();

    String authReq = server.header("Authorization");
    if (authReq.startsWith("Basic ")) {
        authReq = authReq.substring(6);
        authReq.trim();
        String decoded = base64::decode(authReq);
        int colonIdx = decoded.indexOf(':');
        if (colonIdx > 0) {
            String user = decoded.substring(0, colonIdx);
            String pass = decoded.substring(colonIdx + 1);
            if (user == ADMIN_USERNAME && Storage::verifyPassword(*s, pass.c_str())) {
                return true;
            }
        }
    }

    server.sendHeader("WWW-Authenticate", "Basic realm=\"ValvePID\"");
    server.send(401, "text/plain", "Unauthorized");
    return false;
}

// ----------------------------------------------------------------------
// HTML хранится в PROGMEM, чтобы не занимать оперативную память постоянно.
// Копия во временный буфер делается только на время обработки запроса.
// ----------------------------------------------------------------------

static const char PAGE_INDEX[] PROGMEM = R"HTML(
<!DOCTYPE html><html lang="ru"><head><meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Valve PID - Мониторинг</title>
<style>
body{font-family:sans-serif;background:#f4f6f8;margin:0;padding:16px;color:#222}
.card{background:#fff;border-radius:10px;padding:16px;margin-bottom:16px;box-shadow:0 1px 3px rgba(0,0,0,.15)}
h1{font-size:20px;margin:0 0 12px}
.row{display:flex;gap:16px;flex-wrap:wrap}
.stat{flex:1;min-width:120px}
.stat .val{font-size:28px;font-weight:bold}
.stat .lbl{font-size:12px;color:#777}
nav a{margin-right:16px;color:#0366d6;text-decoration:none;font-weight:bold}
canvas{width:100%;height:220px}
.badge{display:inline-block;padding:2px 8px;border-radius:10px;font-size:12px;color:#fff}
.ok{background:#2ea44f}.bad{background:#cb2431}
</style></head><body>
<nav><a href="/">Мониторинг</a><a href="/settings">Настройки</a></nav>
<div class="card"><h1>Состояние устройства</h1>
<div class="row">
<div class="stat"><div class="val" id="temp">--</div><div class="lbl">Температура, &deg;C</div></div>
<div class="stat"><div class="val" id="valve">--</div><div class="lbl">Открытие крана, %</div></div>
<div class="stat"><div class="val" id="setpoint">--</div><div class="lbl">Уставка, &deg;C</div></div>
<div class="stat"><div class="val"><span id="wifi" class="badge">...</span></div><div class="lbl">Сеть / IP: <span id="ip">-</span></div></div>
<div class="stat"><div class="val" id="battVal">--</div><div class="lbl">Батарея: <span id="battBadge" class="badge">...</span></div></div>
</div></div>
<div class="card"><h1>График за 24 часа</h1><canvas id="chart"></canvas></div>
<script>
async function refreshStatus(){
  try{
    const r = await fetch('/api/status'); const d = await r.json();
    document.getElementById('temp').textContent = d.temp.toFixed(1);
    document.getElementById('valve').textContent = d.valve.toFixed(0);
    document.getElementById('setpoint').textContent = d.setpoint.toFixed(1);
    const wifiEl = document.getElementById('wifi');
    wifiEl.textContent = d.apMode ? 'AP режим' : (d.wifiConnected ? 'Подключено' : 'Нет сети');
    wifiEl.className = 'badge ' + (d.wifiConnected && !d.apMode ? 'ok' : 'bad');
    document.getElementById('ip').textContent = d.ip;

    const battBadge = document.getElementById('battBadge');
    const battVal = document.getElementById('battVal');
    if (!d.battery.connected) {
      battVal.textContent = '--';
      battBadge.textContent = 'не подключена';
      battBadge.className = 'badge bad';
    } else {
      battVal.textContent = d.battery.percent.toFixed(0) + '% (' + d.battery.voltage.toFixed(2) + 'В)';
      battBadge.textContent = 'подключена';
      battBadge.className = 'badge ok';
    }
  }catch(e){}
}
let historyCache = [];
async function refreshHistory(){
  try{
    const r = await fetch('/api/history'); historyCache = await r.json(); drawChart();
  }catch(e){}
}
function drawChart(){
  const c = document.getElementById('chart'); const ctx = c.getContext('2d');
  const w = c.clientWidth, h = c.clientHeight;
  c.width = w; c.height = h;
  ctx.clearRect(0,0,w,h);
  if (!historyCache.length){ ctx.fillText('Нет данных', 10, 20); return; }
  const vals = historyCache.map(p=>p.v);
  const minV = Math.min(...vals) - 1, maxV = Math.max(...vals) + 1;
  const pad = 30;
  ctx.strokeStyle = '#0366d6'; ctx.lineWidth = 2; ctx.beginPath();
  historyCache.forEach((p,i)=>{
    const x = pad + (w - pad*2) * (i / (historyCache.length - 1 || 1));
    const y = h - pad - (h - pad*2) * ((p.v - minV) / (maxV - minV || 1));
    if (i===0) ctx.moveTo(x,y); else ctx.lineTo(x,y);
  });
  ctx.stroke();
  ctx.fillStyle = '#777'; ctx.font = '11px sans-serif';
  ctx.fillText(maxV.toFixed(1)+'C', 2, pad);
  ctx.fillText(minV.toFixed(1)+'C', 2, h - pad + 10);
}
refreshStatus(); refreshHistory();
setInterval(refreshStatus, 2000);
setInterval(refreshHistory, 60000);
window.addEventListener('resize', drawChart);
</script></body></html>
)HTML";

