Sakuemy/ESP8266_ValvePID/WebServerManager.cpp
static const char PAGE_SETTINGS[] PROGMEM = R"HTML(
<!DOCTYPE html><html lang="ru"><head><meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Valve PID - Настройки</title>
<style>
body{font-family:sans-serif;background:#f4f6f8;margin:0;padding:16px;color:#222}
.card{background:#fff;border-radius:10px;padding:16px;margin-bottom:16px;box-shadow:0 1px 3px rgba(0,0,0,.15)}
h1{font-size:20px;margin:0 0 12px}
nav a{margin-right:16px;color:#0366d6;text-decoration:none;font-weight:bold}
label{display:block;margin-top:10px;font-size:13px;color:#555}
input,select{width:100%;box-sizing:border-box;padding:8px;margin-top:4px;border:1px solid #ccc;border-radius:6px}
button{margin-top:14px;padding:10px 18px;border:none;border-radius:6px;background:#0366d6;color:#fff;font-weight:bold;cursor:pointer}
.msg{margin-top:10px;font-size:13px}
.grid{display:grid;grid-template-columns:1fr 1fr;gap:0 16px}
</style></head><body>
<nav><a href="/">Мониторинг</a><a href="/settings">Настройки</a></nav>

<div class="card"><h1>ПИД-регулятор</h1>
<form id="pidForm">
<div class="grid">
<div><label>Kp<input type="number" step="0.01" name="kp"></label></div>
<div><label>Ki<input type="number" step="0.01" name="ki"></label></div>
<div><label>Kd<input type="number" step="0.01" name="kd"></label></div>
<div><label>Уставка, &deg;C<input type="number" step="0.1" name="setpoint"></label></div>
</div>
<button type="submit">Сохранить ПИД</button><div class="msg" id="pidMsg"></div>
</form></div>

<div class="card"><h1>Сервопривод / кран</h1>
<form id="servoForm">
<div class="grid">
<div><label>Мин. открытие, %<input type="number" min="0" max="100" name="minPercent"></label></div>
<div><label>Макс. открытие, %<input type="number" min="0" max="100" name="maxPercent"></label></div>
<div><label>Импульс "закрыто", мкс<input type="number" name="closedPulseUs"></label></div>
<div><label>Импульс "открыто", мкс<input type="number" name="openPulseUs"></label></div>
</div>
<button type="submit">Сохранить сервопривод</button><div class="msg" id="servoMsg"></div>
</form></div>

<div class="card"><h1>Батарея</h1>
<p style="font-size:13px;color:#555;margin-top:0">Укажите реальное напряжение батареи, соответствующее 0% и 100% заряда (измерьте мультиметром на полностью разряженной и полностью заряженной батарее).</p>
<p style="font-size:13px;color:#555">Если на пин A0 батарея подключена через собственный (внешний) резистивный делитель напряжения, укажите его коэффициент: ratio = (R1+R2)/R2, где R1 - от плюса батареи к A0, R2 - от A0 к земле. Если делителя нет (кроме встроенного в плату) - оставьте 1.</p>
<form id="battForm">
<div class="grid">
<div><label>Напряжение при 0%, В<input type="number" step="0.01" name="v0"></label></div>
<div><label>Напряжение при 100%, В<input type="number" step="0.01" name="v100"></label></div>
<div><label>Коэффициент делителя (A0)<input type="number" step="0.001" min="1" name="dividerRatio"></label></div>
</div>
<button type="submit">Сохранить калибровку батареи</button><div class="msg" id="battMsg"></div>
</form></div>

<div class="card"><h1>Время / часовой пояс</h1>
<p style="font-size:13px;color:#555;margin-top:0">Синхронизация времени идёт по NTP в UTC; здесь задаётся только смещение для отображения локального времени на графике. Работает без Wi-Fi только приблизительно (счёт от последней успешной синхронизации).</p>
<form id="timeForm">
<label>Часовой пояс (смещение от UTC)
<select name="gmtOffsetHours">
<option value="-12">UTC-12</option><option value="-11">UTC-11</option><option value="-10">UTC-10</option>
<option value="-9">UTC-9</option><option value="-8">UTC-8</option><option value="-7">UTC-7</option>
<option value="-6">UTC-6</option><option value="-5">UTC-5</option><option value="-4">UTC-4</option>
<option value="-3">UTC-3</option><option value="-2">UTC-2</option><option value="-1">UTC-1</option>
<option value="0">UTC+0</option><option value="1">UTC+1</option><option value="2">UTC+2 (Калининград)</option>
<option value="3">UTC+3 (Москва)</option><option value="4">UTC+4 (Самара)</option><option value="5">UTC+5 (Екатеринбург)</option>
<option value="5.5">UTC+5:30 (Индия)</option><option value="6">UTC+6 (Омск)</option><option value="7">UTC+7 (Красноярск)</option>
<option value="8">UTC+8 (Иркутск)</option><option value="9">UTC+9 (Якутск)</option><option value="10">UTC+10 (Владивосток)</option>
<option value="11">UTC+11 (Магадан)</option><option value="12">UTC+12 (Камчатка)</option><option value="13">UTC+13</option><option value="14">UTC+14</option>
</select>
</label>
<button type="submit">Сохранить часовой пояс</button><div class="msg" id="timeMsg"></div>
</form></div>

<div class="card"><h1>Безопасность</h1>
<p style="font-size:13px;color:#555;margin-top:0">Пароль для входа в эти настройки (веб и меню на дисплее). Логин фиксирован: <b>admin</b>.</p>
<form id="secForm">
<label>Текущий пароль<input type="password" name="currentPassword" autocomplete="current-password"></label>
<label>Новый пароль<input type="password" name="newPassword" maxlength="32" autocomplete="new-password"></label>
<label>Повторите новый пароль<input type="password" name="newPasswordConfirm" maxlength="32" autocomplete="new-password"></label>
<button type="submit">Сменить пароль</button><div class="msg" id="secMsg"></div>
</form></div>

<div class="card"><h1>Wi-Fi / сеть</h1>
<form id="netForm">
<label>SSID<input type="text" name="ssid" maxlength="32"></label>
<label>Пароль (оставьте пустым, чтобы не менять)<input type="password" name="password" maxlength="64"></label>
<label>Режим получения IP
<select name="dhcp"><option value="1">DHCP (автоматически)</option><option value="0">Статический IP</option></select>
</label>
<div class="grid">
<div><label>IP-адрес<input type="text" name="ip" placeholder="192.168.1.50"></label></div>
<div><label>Шлюз<input type="text" name="gateway" placeholder="192.168.1.1"></label></div>
<div><label>Маска подсети<input type="text" name="subnet" placeholder="255.255.255.0"></label></div>
<div><label>DNS<input type="text" name="dns" placeholder="8.8.8.8"></label></div>
</div>
<button type="submit">Сохранить сеть и переподключиться</button><div class="msg" id="netMsg"></div>
</form></div>

<script>
function ipToStr(n){ if(!n) return ''; return [(n>>24)&255,(n>>16)&255,(n>>8)&255,n&255].join('.'); }
function strToIp(s){ const p=(s||'').split('.').map(Number); if(p.length!==4||p.some(isNaN)) return 0; return ((p[0]<<24)>>>0)+((p[1]<<16))+((p[2]<<8))+p[3]; }

async function loadSettings(){
  const r = await fetch('/api/settings'); const d = await r.json();
  const pf = document.getElementById('pidForm');
  pf.kp.value = d.pid.kp; pf.ki.value = d.pid.ki; pf.kd.value = d.pid.kd; pf.setpoint.value = d.pid.setpoint;
  const sf = document.getElementById('servoForm');
  sf.minPercent.value = d.servo.minPercent; sf.maxPercent.value = d.servo.maxPercent;
  sf.closedPulseUs.value = d.servo.closedPulseUs; sf.openPulseUs.value = d.servo.openPulseUs;
  const bf = document.getElementById('battForm');
  bf.v0.value = d.battery.v0; bf.v100.value = d.battery.v100; bf.dividerRatio.value = d.battery.dividerRatio;
  const tf = document.getElementById('timeForm');
  tf.gmtOffsetHours.value = (d.time.gmtOffsetSec / 3600);
  const nf = document.getElementById('netForm');
  nf.ssid.value = d.net.ssid; nf.dhcp.value = d.net.dhcp ? '1':'0';
  nf.ip.value = ipToStr(d.net.ip); nf.gateway.value = ipToStr(d.net.gateway);
  nf.subnet.value = ipToStr(d.net.subnet); nf.dns.value = ipToStr(d.net.dns);
}
async function postForm(url, data, msgId){
  const msg = document.getElementById(msgId);
  msg.textContent = 'Сохранение...';
  try{
    const r = await fetch(url, {method:'POST', headers:{'Content-Type':'application/x-www-form-urlencoded'}, body: new URLSearchParams(data)});
    if (r.ok) { msg.textContent = 'Сохранено'; msg.style.color = 'green'; }
    else { msg.textContent = 'Ошибка сохранения'; msg.style.color = 'red'; }
  }catch(e){ msg.textContent = 'Ошибка сети'; msg.style.color = 'red'; }
}
document.getElementById('pidForm').addEventListener('submit', function(e){
  e.preventDefault();
  const f = e.target;
  postForm('/api/settings/pid', {kp:f.kp.value, ki:f.ki.value, kd:f.kd.value, setpoint:f.setpoint.value}, 'pidMsg');
});
