Sakuemy/ESP8266_ValvePID/WebServerManager.cpp
document.getElementById('servoForm').addEventListener('submit', function(e){
  e.preventDefault();
  const f = e.target;
  postForm('/api/settings/servo', {minPercent:f.minPercent.value, maxPercent:f.maxPercent.value, closedPulseUs:f.closedPulseUs.value, openPulseUs:f.openPulseUs.value}, 'servoMsg');
});
document.getElementById('battForm').addEventListener('submit', function(e){
  e.preventDefault();
  const f = e.target;
  postForm('/api/settings/battery', {v0:f.v0.value, v100:f.v100.value, dividerRatio:f.dividerRatio.value}, 'battMsg');
});
document.getElementById('timeForm').addEventListener('submit', function(e){
  e.preventDefault();
  const f = e.target;
  const gmtOffsetSec = Math.round(parseFloat(f.gmtOffsetHours.value) * 3600);
  postForm('/api/settings/time', {gmtOffsetSec}, 'timeMsg');
});
document.getElementById('secForm').addEventListener('submit', async function(e){
  e.preventDefault();
  const f = e.target;
  const msg = document.getElementById('secMsg');
  if (f.newPassword.value !== f.newPasswordConfirm.value) {
    msg.textContent = 'Новые пароли не совпадают'; msg.style.color = 'red'; return;
  }
  if (f.newPassword.value.length < 4) {
    msg.textContent = 'Пароль слишком короткий (мин. 4 симв.)'; msg.style.color = 'red'; return;
  }
  msg.textContent = 'Сохранение...';
  try{
    const r = await fetch('/api/settings/security', {method:'POST', headers:{'Content-Type':'application/x-www-form-urlencoded'},
      body: new URLSearchParams({currentPassword:f.currentPassword.value, newPassword:f.newPassword.value})});
    const d = await r.json().catch(()=>({}));
    if (r.ok && d.ok) { msg.textContent = 'Пароль изменён'; msg.style.color = 'green'; f.reset(); }
    else { msg.textContent = d.error || 'Ошибка: неверный текущий пароль'; msg.style.color = 'red'; }
  }catch(e){ msg.textContent = 'Ошибка сети'; msg.style.color = 'red'; }
});
document.getElementById('netForm').addEventListener('submit', function(e){
  e.preventDefault();
  const f = e.target;
  postForm('/api/settings/network', {
    ssid:f.ssid.value, password:f.password.value, dhcp:f.dhcp.value,
    ip: strToIp(f.ip.value), gateway: strToIp(f.gateway.value),
    subnet: strToIp(f.subnet.value), dns: strToIp(f.dns.value)
  }, 'netMsg');
});
loadSettings();
</script></body></html>
)HTML";

// ----------------------------------------------------------------------
// Обработчики
// ----------------------------------------------------------------------

static void handleIndex() {
    server.send_P(200, "text/html", PAGE_INDEX);
}

static void handleSettingsPage() {
    if (!requireAuth()) return;
    server.send_P(200, "text/html", PAGE_SETTINGS);
}

static void handleApiStatus() {
    StaticJsonDocument<384> doc;
    doc["temp"] = TempSensor::isValid() ? TempSensor::getTemperature() : NAN;
    doc["valve"] = ValveServo::getCurrentPercent();
    doc["setpoint"] = callbacks_.getSettings()->pid.setpoint;
    doc["wifiConnected"] = NetworkManager::isConnected();
    doc["apMode"] = NetworkManager::isApMode();
    doc["ip"] = NetworkManager::getIpAddress();
    doc["timeSynced"] = TimeManager::hasSyncedOnce();
    doc["unixTime"] = TimeManager::now();

    doc["battery"]["connected"] = BatteryMonitor::isConnected();
    doc["battery"]["voltage"] = BatteryMonitor::getVoltage();
    doc["battery"]["percent"] = BatteryMonitor::getPercent();

    String out;
    serializeJson(doc, out);
    server.send(200, "application/json", out);
}

static void handleApiHistory() {
    String out;
    TempHistory::serializeToJson(out);
    server.send(200, "application/json", out);
}

static void handleApiSettingsGet() {
    if (!requireAuth()) return;
    AppSettings *s = callbacks_.getSettings();
    StaticJsonDocument<CONFIG_JSON_CAPACITY> doc;

    doc["pid"]["kp"] = s->pid.kp;
    doc["pid"]["ki"] = s->pid.ki;
    doc["pid"]["kd"] = s->pid.kd;
    doc["pid"]["setpoint"] = s->pid.setpoint;

    doc["servo"]["minPercent"] = s->servo.minPercent;
    doc["servo"]["maxPercent"] = s->servo.maxPercent;
    doc["servo"]["closedPulseUs"] = s->servo.closedPulseUs;
    doc["servo"]["openPulseUs"] = s->servo.openPulseUs;

    doc["net"]["ssid"] = s->network.ssid;
    // Пароль сознательно не отдаём обратно клиенту из соображений безопасности.
    doc["net"]["dhcp"] = s->network.useDhcp;
    doc["net"]["ip"] = s->network.staticIp;
    doc["net"]["gateway"] = s->network.staticGateway;
    doc["net"]["subnet"] = s->network.staticSubnet;
    doc["net"]["dns"] = s->network.staticDns;

    doc["battery"]["v0"] = s->battery.voltageAt0Percent;
    doc["battery"]["v100"] = s->battery.voltageAt100Percent;
    doc["battery"]["dividerRatio"] = s->battery.dividerRatio;

    doc["time"]["gmtOffsetSec"] = s->time.gmtOffsetSec;

    String out;
    serializeJson(doc, out);
    server.send(200, "application/json", out);
}

static void handleApiSettingsPid() {
    if (!requireAuth()) return;
    AppSettings *s = callbacks_.getSettings();
    if (server.hasArg("kp")) s->pid.kp = server.arg("kp").toDouble();
    if (server.hasArg("ki")) s->pid.ki = server.arg("ki").toDouble();
    if (server.hasArg("kd")) s->pid.kd = server.arg("kd").toDouble();
    if (server.hasArg("setpoint")) s->pid.setpoint = server.arg("setpoint").toDouble();

    Storage::save(*s);
    if (callbacks_.onSettingsChanged) callbacks_.onSettingsChanged();
    server.send(200, "application/json", "{\"ok\":true}");
}

static void handleApiSettingsServo() {
    if (!requireAuth()) return;
    AppSettings *s = callbacks_.getSettings();
    if (server.hasArg("minPercent")) s->servo.minPercent = (uint8_t)constrain(server.arg("minPercent").toInt(), 0, 100);
    if (server.hasArg("maxPercent")) s->servo.maxPercent = (uint8_t)constrain(server.arg("maxPercent").toInt(), 0, 100);
    if (server.hasArg("closedPulseUs")) s->servo.closedPulseUs = (uint16_t)server.arg("closedPulseUs").toInt();
    if (server.hasArg("openPulseUs")) s->servo.openPulseUs = (uint16_t)server.arg("openPulseUs").toInt();

    if (s->servo.minPercent > s->servo.maxPercent) {
        // защита от некорректного ввода - не даём min стать больше max
        uint8_t tmp = s->servo.minPercent;
        s->servo.minPercent = s->servo.maxPercent;
        s->servo.maxPercent = tmp;
    }

    Storage::save(*s);
    if (callbacks_.onSettingsChanged) callbacks_.onSettingsChanged();
    server.send(200, "application/json", "{\"ok\":true}");
}

static void handleApiSettingsBattery() {
    if (!requireAuth()) return;
    AppSettings *s = callbacks_.getSettings();
    if (server.hasArg("v0")) s->battery.voltageAt0Percent = server.arg("v0").toFloat();
    if (server.hasArg("v100")) s->battery.voltageAt100Percent = server.arg("v100").toFloat();
    if (server.hasArg("dividerRatio")) {
        float ratio = server.arg("dividerRatio").toFloat();
        if (ratio < 1.0f) ratio = 1.0f; // делитель не может "усиливать" напряжение
        s->battery.dividerRatio = ratio;
    }

    Storage::save(*s);
    if (callbacks_.onSettingsChanged) callbacks_.onSettingsChanged();
    server.send(200, "application/json", "{\"ok\":true}");
}

// Смещение часового пояса, в секундах от UTC. Диапазон ограничен реально
// существующими часовыми поясами (-12..+14ч) на случай некорректного ввода.
static void handleApiSettingsTime() {
    if (!requireAuth()) return;
    AppSettings *s = callbacks_.getSettings();
    if (server.hasArg("gmtOffsetSec")) {
        long offset = server.arg("gmtOffsetSec").toInt();
        const long minOffset = -12L * 3600L;
        const long maxOffset =  14L * 3600L;
        if (offset < minOffset) offset = minOffset;
        if (offset > maxOffset) offset = maxOffset;
        s->time.gmtOffsetSec = (int32_t)offset;
    }

    Storage::save(*s);
    if (callbacks_.onSettingsChanged) callbacks_.onSettingsChanged();
    server.send(200, "application/json", "{\"ok\":true}");
}

// Смена пароля доступа к настройкам. Требует правильный текущий пароль,
// иначе тот, кто уже случайно оставил браузер авторизованным, не мог бы
// незаметно "увести" устройство сменой пароля без знания старого.
static void handleApiSettingsSecurity() {
    if (!requireAuth()) return;
    AppSettings *s = callbacks_.getSettings();

