Sakuemy/ESP8266_ValvePID/WebServerManager.cpp
    String current = server.hasArg("currentPassword") ? server.arg("currentPassword") : "";
    String newPass  = server.hasArg("newPassword") ? server.arg("newPassword") : "";

    if (!Storage::verifyPassword(*s, current.c_str())) {
        server.send(403, "application/json", "{\"ok\":false,\"error\":\"Неверный текущий пароль\"}");
        return;
    }
    if (newPass.length() < 4) {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"Пароль слишком короткий\"}");
        return;
    }
    if (newPass.length() >= ADMIN_PASSWORD_MAX_LEN) {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"Пароль слишком длинный\"}");
        return;
    }

    Storage::setPassword(*s, newPass.c_str());
    Storage::save(*s);
    if (callbacks_.onSettingsChanged) callbacks_.onSettingsChanged();
    server.send(200, "application/json", "{\"ok\":true}");
}

static void handleApiSettingsNetwork() {
    if (!requireAuth()) return;
    AppSettings *s = callbacks_.getSettings();
    if (server.hasArg("ssid")) strlcpy(s->network.ssid, server.arg("ssid").c_str(), sizeof(s->network.ssid));
    if (server.hasArg("password") && server.arg("password").length() > 0) {
        strlcpy(s->network.password, server.arg("password").c_str(), sizeof(s->network.password));
    }
    if (server.hasArg("dhcp")) s->network.useDhcp = server.arg("dhcp").toInt() != 0;
    if (server.hasArg("ip")) s->network.staticIp = (uint32_t)server.arg("ip").toInt();
    if (server.hasArg("gateway")) s->network.staticGateway = (uint32_t)server.arg("gateway").toInt();
    if (server.hasArg("subnet")) s->network.staticSubnet = (uint32_t)server.arg("subnet").toInt();
    if (server.hasArg("dns")) s->network.staticDns = (uint32_t)server.arg("dns").toInt();

    Storage::save(*s);
    if (callbacks_.onSettingsChanged) callbacks_.onSettingsChanged();

    server.send(200, "application/json", "{\"ok\":true}");
    // Переподключение делаем ПОСЛЕ отправки ответа, чтобы браузер успел
    // получить подтверждение до возможного разрыва текущего соединения.
    NetworkManager::applySettings(s->network);
}

static void handleNotFound() {
    server.send(404, "text/plain", "Not found");
}

void begin(const Callbacks &callbacks) {
    callbacks_ = callbacks;

    // Явно просим сервер сохранять заголовок Authorization - без этого
    // server.header("Authorization") в requireAuth() всегда возвращал бы
    // пустую строку (сервер по умолчанию не хранит произвольные заголовки).
    static const char *authHeaderKeys[] = { "Authorization" };
    server.collectHeaders(authHeaderKeys, 1);

    server.on("/", HTTP_GET, handleIndex);
    server.on("/settings", HTTP_GET, handleSettingsPage);
    server.on("/api/status", HTTP_GET, handleApiStatus);
    server.on("/api/history", HTTP_GET, handleApiHistory);
    server.on("/api/settings", HTTP_GET, handleApiSettingsGet);
    server.on("/api/settings/pid", HTTP_POST, handleApiSettingsPid);
    server.on("/api/settings/servo", HTTP_POST, handleApiSettingsServo);
    server.on("/api/settings/battery", HTTP_POST, handleApiSettingsBattery);
    server.on("/api/settings/time", HTTP_POST, handleApiSettingsTime);
    server.on("/api/settings/network", HTTP_POST, handleApiSettingsNetwork);
    server.on("/api/settings/security", HTTP_POST, handleApiSettingsSecurity);
    server.onNotFound(handleNotFound);

    server.begin();
    Serial.println(F("[Web] HTTP-сервер запущен на порту 80"));
}

void update() {
    server.handleClient();
}

} // namespace WebServerManager
